## Plan Result (Managed_Identity)




<pre><code>Plan: 1 to add, 0 to change, 0 to destroy.</code></pre>

* Create
  * azurerm_role_assignment.acme-vault-reader




<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_role_assignment.acme-vault-reader will be created
  + resource "azurerm_role_assignment" "acme-vault-reader" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "e1f40a06-0c5e-4c63-a804-163b8911cc87"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Key Vault Reader"
      + scope                            = "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/resourceGroups/cft-platform-sbox-rg/providers/Microsoft.KeyVault/vaults/acmedcdcftappssbox"
      + skip_service_principal_aad_check = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.
```

</details>





<!-- github-comment: {"Command":"plan","PRNumber":542,"Program":"tfcmt","SHA1":"","Target":"Managed_Identity","Vars":{}} -->